---
kind: other
id: Methods.T:Autodesk.Revit.DB.FabricationPart
source: html/c5e451b2-aee9-c602-e3d0-873b452fa2e7.htm
---
# FabricationPart Methods

Add custom data type to the fabrication part. The new data gets the default value defined by the fabrication configuration.